#!/usr/bin/env python3

'''
ryYinyang.py

用 繁體中文(traditional Chinese)
龜模組 turtle_tc.py
示範 龜 畫 陰陽 太極圖。(YinYang TaiJi)

by 呂仁園, Renyuan Lyu
2014/03/24, 06/14

'''

from  turtle_tc import *

def 陰陽(半徑, 色01, 色02):

    形狀(龜形); 筆大小(2); 
    
    顏色(色02, 色01); 開始填色();
    畫圓(半徑/2, 180); 畫圓(半徑, 180)
    左轉(180); 畫圓(-半徑/2, 180)
    結束填色()
    
    左轉(90); 提筆(); 前進(半徑/3)
    右轉(90); 下筆(); 
    
    顏色(色01, 色02); 開始填色();
    畫圓(半徑/6)
    結束填色()
    
    左轉(90); 提筆(); 後退(半徑/3)
    左轉(90); 下筆(); 

def 主函數():

    重設(); 背景色(灰);
       
    陰陽(200,黑,白);
    陰陽(200,白,黑)
    
    陰陽(100,紅,青);
    陰陽(100,青,紅)
    
    陰陽( 50,黃,藍);
    陰陽( 50,藍,黃)

    左轉(90);  藏龜(); 提筆(); 
    前進(250); 顯龜(); 下筆();
    寫('陰陽太極')

    進入主迴圈()

if __name__ == '__main__':

    主函數()
