'''

用漢字來做程式設計
==================
呂仁園
-------
2014/04/24

傳統漢字(traditional Chinese)
龜模組(tirtle module)
下載處：

https://www.dropbox.com/s/enatm4yh3fxk3dq/turtle_tc.py

'''
from turtle_tc import  *

def 畫Teddy():

    模式(角度從北開始順時針)

    速度(10)
    形狀(龜形)

    筆大小(3)
    筆色(黑)
    下筆()
    畫圓(66)

    右轉(180)
    畫圓(66)

    提筆()
    左轉(90)
    前進(33)
    右轉(90)
    前進(34)
    下筆()
    填色(藍)

    開始填色()
    畫圓(33)
    結束填色()

    提筆()
    前進(15)
    左轉(90)
    前進(4)
    右轉(90)
    下筆()
    填色(黑)

    開始填色()
    畫圓(11)
    結束填色()

    提筆()
    回家()
    左轉(90)
    前進(33)
    左轉(90)
    前進(34)
    左轉(180)
    下筆()
    填色(藍)

    開始填色()
    畫圓(33)
    結束填色()

    提筆()
    後退(15)
    右轉(90)
    後退(4)
    左轉(90)
    下筆()
    填色(黑)

    開始填色()
    畫圓(11)
    結束填色()

    提筆()
    回家()
    左轉(180)
    前進(70)
    下筆()
    前進(30)
    畫圓(30, 180)

    提筆()
    右轉(180)
    畫圓(-30, -180)

    左轉(180)
    下筆()
    畫圓(-30, 180)

    右轉(180)
    畫圓(30, 90)

    右轉(90)
    填色(紅)

    開始填色()
    畫圓(30, 180)
    結束填色()

    提筆()
    回家()
    前進(80)
    右轉(90)
    前進(100)
    填色(黃)
    下筆()
    左轉(50)
    畫圓(-70, 200)

    提筆()
    回家()
    前進(80)
    左轉(90)
    前進(100)
    下筆()
    右轉(50)
    畫圓(70, 200)

    提筆()
    回家()
    左轉(90)
    前進(190)
    左轉(90)
    前進(40)
    下筆()
    畫圓(190, 180)

    提筆()
    回家()
    前進(80)
    下筆()
    畫圓(50, 60)

    右轉(180)
    畫圓(-50, 60)

    右轉(180)
    畫圓(-60, 60)

    左轉(180)
    畫圓(60, 60)

    左轉(180)
    畫圓(-30, 60)

    提筆()
    回家()
    後退(110)
    左轉(90)
    前進(20)
    下筆()
    前進(1)

    提筆()
    前進(19)
    下筆()
    前進(1)

    提筆()
    右轉(180)
    前進(60)
    下筆()
    前進(1)

    提筆()
    前進(19)

    下筆()
    前進(1)
    提筆()
    右轉(90)
    前進(10)

    右轉(90)
    前進(10)

    下筆()
    前進(1)

    提筆()
    前進(60)

    下筆()
    前進(1)

    提筆()
    回家()
    隱藏()

    前往(0,-200)
    筆色(紫)
    寫('大家好，我是 Teddy。')

    進入主迴圈()


if __name__ == "__main__":

    畫Teddy()

