'''
ryTeddy001.py

用漢字來做程式設計
==================
呂仁園
-------
2014/04/24, 2014/11/18, 2014/12/06

傳統漢字(traditional Chinese)
龜模組(turtle module)
turtle_tc.py 

http://goo.gl/cyfU5F

'''
from turtle_tc import  *

家坐標= (0,0)
比例= 1


def 初始準備動作():

    提筆(); 前往(家坐標); 設頭向(0); 速度(0);  形狀(龜形); 筆大小(3); 筆色(黑)

def 眼眶():

    下筆(); 畫圓(66 *比例); 右轉(180); 畫圓(66*比例)

def 右眼珠():

    提筆(); 左轉(90); 前進(33*比例); 右轉(90); 前進(34*比例)
    下筆(); 填色(藍); 開始填色(); 畫圓(33*比例); 結束填色()

def 右瞳孔():

    提筆(); 前進(15*比例); 左轉(90);  前進(4*比例); 右轉(90)
    下筆(); 填色(黑); 開始填色(); 畫圓(11*比例); 結束填色()

def 左眼珠():

    提筆(); 前往(家坐標);設頭向(0); 左轉(90); 前進(33*比例); 左轉(90); 前進(34*比例); 左轉(180)
    下筆(); 填色(藍); 開始填色(); 畫圓(33*比例); 結束填色()

def 左瞳孔():

    提筆(); 後退(15*比例); 右轉(90); 後退(4*比例); 左轉(90)
    下筆(); 填色(黑); 開始填色(); 畫圓(11*比例); 結束填色()

def 右鼻():

    提筆(); 前往(家坐標); 設頭向(0); 左轉(180); 前進(70*比例); 
    下筆(); 前進(30*比例); 畫圓(30*比例, 180)

def 左鼻():

    提筆(); 右轉(180); 畫圓(-30*比例, -180); 左轉(180)
    下筆(); 畫圓(-30*比例, 180); 右轉(180); 畫圓(30*比例, 90); 右轉(90)

def 嘴():

    填色(紅); 開始填色(); 畫圓(30*比例, 180); 結束填色()

def 右耳():

    提筆(); 前往(家坐標); 設頭向(0); 前進(80*比例); 右轉(90); 前進(100*比例); 填色(黃)
    下筆(); 左轉(50); 畫圓(-70*比例, 200)
  
def 左耳():

    提筆(); 前往(家坐標); 設頭向(0); 前進(80*比例); 左轉(90); 前進(100*比例); 
    下筆(); 右轉(50); 畫圓(70*比例, 200)

def 下巴():

    提筆(); 前往(家坐標); 設頭向(0); 左轉(90); 前進(190*比例); 左轉(90); 前進(40*比例);
    下筆(); 畫圓(190*比例, 180)

def 頭毛():

    提筆(); 前往(家坐標); 設頭向(0); 前進(80*比例);
    下筆(); 畫圓( 50*比例, 60); 右轉(180); 提筆();畫圓(-50*比例, 60); 右轉(180)
    下筆(); 畫圓(-60*比例, 60); 左轉(180); 提筆();畫圓( 60*比例, 60); 左轉(180)
    下筆(); 畫圓(-30*比例, 60);

def 鬍鬚小點():

    提筆(); 前往(家坐標); 設頭向(0); 後退(110*比例); 左轉(90); 前進(20*比例);
    下筆(); 前進(1*比例); 提筆(); 前進(19*比例)
    下筆(); 前進(1*比例); 提筆(); 右轉(180); 前進(60*比例)
    下筆(); 前進(1*比例); 提筆(); 前進(19*比例)
    下筆(); 前進(1*比例); 提筆(); 右轉(90); 前進(10*比例); 右轉(90); 前進(10*比例);
    下筆(); 前進(1*比例); 提筆(); 前進(60*比例)
    下筆(); 前進(1*比例); 

def 寫字():

    提筆(); 前往(家坐標); 設頭向(0); 
    後退(200*比例); 右轉(90); 後退(50*比例); 隱藏(); 筆色(紫); 
    if 比例>=1: 寫('大家好，我是 Teddy。',font= 20*比例); 
    提筆()

def 畫全圖(坐標=(0,0), 比=1):

    global 家坐標, 比例

    家坐標= 坐標
    比例=   比
 
    初始準備動作();
    眼眶(); 
    右眼珠(); 右瞳孔(); 
    左眼珠(); 左瞳孔(); 
    右鼻();   左鼻(); 嘴();  
    右耳();   左耳(); 下巴(); 
    頭毛();   鬍鬚小點(); 
    寫字();

    return '完成！'

def 主函數():
 
    模式(角度從北開始順時針)
    
    畫全圖()
    畫全圖(( 200,200), .5)
    畫全圖((-200,200), .5)

main= 主函數

if __name__ == "__main__":

    主函數()
    主迴圈()
